leetcode_315_count_of_smaller_numbers_after_self.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Leetcode: 315. Count of Smaller Numbers After Self</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="style.css">

</head>
<body>
<!--  --><nav><span class="nav-header">Problem Solving</span><span class="nav-items"><a href="index.html">Home</a><span></nav><div id="content" class="content">
<h1 class="title">Leetcode: 315. Count of Smaller Numbers After Self</h1>
<ul class="org-ul">
<li><a href="pattern_answer_query_on_sorted_data.html#ID-A18543C4-83BC-40F1-A243-B85FD935FAC0">Pattern: Answer query on sorted data</a>.</li>

<li><a href="can_you_break_down_the_problem_in_small_and_easily_to_solve_parts.html#ID-69D68202-BF1A-4D72-A0EC-DDCBAF112500">Can we break-down the problem in small and easily to solve parts?</a>  Suppose we are processing the element \(i\) from right to left, if we keep element \(nums[i+1,...,n-1]\) sorted, the problem becomes finding the right-most index where we could add \(nums[i]\) to the sorted list while keeping it sorted.  Time complexity is \(O(n \log n)\) and space is \(O(n)\).</li>
</ul>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">from</span> typing <span style="font-weight: bold;">import</span> List
<span style="font-weight: bold;">from</span> sortedcontainers <span style="font-weight: bold;">import</span> SortedList


<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Solution</span>:
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">countSmaller</span>(<span style="font-weight: bold;">self</span>, nums: List[<span style="font-weight: bold;">int</span>]) -&gt; <span style="font-weight: bold; font-style: italic;">List</span>[<span style="font-weight: bold;">int</span>]:
        right = SortedList([])
        <span style="font-weight: bold; font-style: italic;">N</span> = <span style="font-weight: bold;">len</span>(nums)
        <span style="font-weight: bold; font-style: italic;">ans</span> = [0] * N
        <span style="font-weight: bold;">for</span> i <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(N - 1, -1, -1):
            <span style="font-weight: bold; font-style: italic;">j</span> = right.bisect_left(nums[i])
            <span style="font-weight: bold; font-style: italic;">ans</span>[<span style="font-weight: bold; font-style: italic;">i</span>] = j
            right.add(nums[i])
        <span style="font-weight: bold;">return</span> ans


<span style="font-weight: bold;">assert</span> Solution().countSmaller([5, 2, 6, 1]) == [2, 1, 1, 0]
<span style="font-weight: bold;">assert</span> Solution().countSmaller([-1]) == [0]
<span style="font-weight: bold;">assert</span> Solution().countSmaller([-1, -1]) == [0, 0]
</pre>
</div>
</div>
</body>
</html>